docs/mfo/20240422102646-mfo_especificar_vs_implementar.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Personal homepage exported with org-thtml">

  <title>Especificar vs Implementar</title>
  <link rel="icon" type="image/x-icon" href="/images/favicon.ico">

  <meta property="og:url" content="https://bugarela.com/mfo/20240422102646-mfo_especificar_vs_implementar.html" />
  <meta property="og:title" content="Especificar vs Implementar" />
  <meta property="og:type" content="article" />
  <meta property="og:description" content="Personal homepage exported with org-thtml" />
  
  
    <meta name="twitter:card" content="summary_large_image">
    <meta name="twitter:site" content="@bugarela">
    <meta name="twitter:title" content="Especificar vs Implementar">
    <meta name="twitter:description" content="Personal homepage exported with org-thtml">
  

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/pure-min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/grids-responsive-min.css">
<link rel="stylesheet" href="../css/layouts/style.css">

  </head>
  <body>
    <div id="layout" class="pure-g">
      <div class="sidebar pure-u-1 pure-u-md-1-3">
  <div class="pure-g">
    <div class="pure-u-1 pure-u-lg-1-2">
    </div>
    <div class="pure-u-1 pure-u-lg-1-2">
      <div class="header">
        <h2 class="brand-title"><a href="../"><i class="fas fa-home"></i> Gabriela Moreira</a></h2>
      </div>
      <div class="centered">
        <h1 class="huge"><i class="fas fa-folder-open"></i></h1>
        <h1 class="huge"><a href="./">MFO</a></h1>
        <h2 class="brand-title">Métodos Formais</h2>
        <h2 class="brand-tagline">Materiais da disciplina</h2>
      </div>
      <div class="footer">
  <div>Created using Emacs and <a href="https://github.com/juanjosegarciaripoll/org-thtml">org-mode</a></div>
</div>

    </div>
  </div>
</div>

      <div class="content pure-u-1 pure-u-md-2-3">
        <h2>Especificar vs Implementar</h2>
        <a href="https://bugarela.com/mfo/slides/20240422102646-mfo_especificar_vs_implementar.pdf">Slides</a><br />
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org98889a6">1. Exercício Pokemons</a>
<ul>
<li><a href="#org54d8af9">1.1. Exercício Pokemons</a></li>
</ul>
</li>
<li><a href="#orgcfa435b">2. Especificar vs Implementar</a>
<ul>
<li><a href="#org62d9704">2.1. Por que estamos escrevendo uma especificação para um jogo de pokemon?</a></li>
<li><a href="#orgbc8de8e">2.2. Mas por que só não implementar e simular?</a></li>
<li><a href="#org84373cb">2.3. Motivação para o trabalho</a></li>
<li><a href="#org2a86f77">2.4. Protocolos</a></li>
<li><a href="#orge1a4d0e">2.5. FIM</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org98889a6" class="outline-2">
<h2 id="org98889a6"><span class="section-number-2">1.</span> Exercício Pokemons</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org54d8af9" class="outline-3">
<h3 id="org54d8af9"><span class="section-number-3">1.1.</span> Exercício Pokemons</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Primeiros 20min de aula serão para vocês continuarem o exercício<br />
<ul class="org-ul">
<li>Objetivo principal é que lembrem onde estavam, qual era a dificuldade, dúvidas, etc.<br /></li>
<li>Se alguém terminou, pode me chamar para ter feedback da solução<br /></li>
</ul></li>

<li>Depois, veremos uma sugestão de resolução.<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcfa435b" class="outline-2">
<h2 id="orgcfa435b"><span class="section-number-2">2.</span> Especificar vs Implementar</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org62d9704" class="outline-3">
<h3 id="org62d9704"><span class="section-number-3">2.1.</span> Por que estamos escrevendo uma especificação para um jogo de pokemon?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Para que a especificação <b>não</b> serve:<br />
</p>
<ul class="org-ul">
<li><p>
Para jogar pokemon<br />
</p>
<ul class="org-ul">
<li>Não temos input/output pros jogadores<br /></li>
</ul></li>
</ul>
<ul class="org-ul">
<li><p>
Para analisar o balanceamento (i.e. Charmander ganha do Squirtle 40% das vezes)<br />
</p>
<ul class="org-ul">
<li>Quint e TLA+ não fazem análise estatística<br /></li>
</ul></li>
</ul>

<p>
Para que ela <b>serve</b>:<br />
</p>
<ul class="org-ul">
<li><p>
Explicar pokemon pra quem não conhece pokemon<br />
</p>
<ul class="org-ul">
<li>A especificação em si é uma descrição precisa do que pode acontecer e do que é esperado<br /></li>
<li>Usando simulação ou <i>model checking</i>, podemos obter execuções exemplo que ajudam no entendimento<br /></li>
</ul></li>
</ul>
<ul class="org-ul">
<li><p>
Verificar propriedades<br />
</p>
<ul class="org-ul">
<li>Verificar que algo desejável pode acontecer (i.e. é possível um pokemon ficar zero ou menos de vida)<br /></li>
<li>Verficar que algo importante é verdade <b>sempre</b> (i.e. usando uma estratégia, o Squirte sempre vence o Charmander)<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbc8de8e" class="outline-3">
<h3 id="orgbc8de8e"><span class="section-number-3">2.2.</span> Mas por que só não implementar e simular?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Por que só não fazemos isso em [insira linguagem de programação] e usamos um laço de repetição para testar N (ou todos) os cenários?<br />
</p>

<p>
Porque:<br />
</p>
<ul class="org-ul">
<li>Quint/TLA+ tem restrições para que seja possível fazer <i>model checking</i><br /></li>
<li>O simulador é reutilizável, com toda a estratégia de simulação e interface<br /></li>
</ul>

<p>
Ah, mas se eu fizer em [insira linguagem de programação], eu já posso usar o programa para jogar também.<br />
</p>
<ul class="org-ul">
<li>Para isso, seria necessário cuidar da distribuição/autorização dos jogadores<br />
<ul class="org-ul">
<li>Jogador 1 só pode escolher os ataques do time A, e jogador 2 só pode escolher os ataques do time B<br /></li>
<li>Isso diminui o nível de abstração, e pode tornar aquilo que é mais importante mais difícil de compreender.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org84373cb" class="outline-3">
<h3 id="org84373cb"><span class="section-number-3">2.3.</span> Motivação para o trabalho</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>O principal motivo para o exercício de pokemons foi trabalhar em um contexto semelhante ao do nosso primeiro trabalho, que envolverá jogos de RPG de mesa.<br /></li>
</ul>
<ul class="org-ul">
<li><p>
Com algumas regras de RPG, conseguimos alguns problemas análogos aos problemas de sistemas distribuídos, campo onde métodos formais são melhor empregados.<br />
</p>
<ul class="org-ul">
<li>Jogos em si não são um bom exemplo por conta da falta de impacto (risco = impacto x ameaça). Geralmente as empresas investem em usar métodos formais onde o impacto de possíveis problemas é muito alto.<br /></li>
</ul>
<ul class="org-ul">
<li>Depois de passar o trabalho, vou explicar um pouco essas analogias. Uma analogia que se aplica ao jogo da velha e ao pokemon: estratégias podem ser vistas como protocolos. Protocolos definem passos que devem acontecer em cada cenário com objetivo de garantir alguma coisa.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2a86f77" class="outline-3">
<h3 id="org2a86f77"><span class="section-number-3">2.4.</span> Protocolos</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Exemplos de protocolos:<br />
</p>
<ul class="org-ul">
<li>Entregar a prova de cabeça pra baixo e pedir que todos desvirem no mesmo momento é uma forma de garantir que todos tem o mesmo tempo de prova<br /></li>
</ul>
<ul class="org-ul">
<li>Na decolagem/pouso de um avião, precisamos abrir as janelas e levantar as mesinhas<br /></li>
</ul>
<ul class="org-ul">
<li>Sistemas de trocas em jogos ou, semelhantemente, sistemas de pagamento estilo mercado pago<br /></li>
</ul>

<p>
Podemos entender protocolos como estratégias para garantir ou impedir que algo aconteça.<br />
</p>

<p>
Podemos entender estratégias de jogo como um protocolo que leva à vitória.<br />
</p>
</div>
</div>
<div id="outline-container-orge1a4d0e" class="outline-3">
<h3 id="orge1a4d0e"><span class="section-number-3">2.5.</span> FIM</h3>
<div class="outline-text-3" id="text-2-5">
</div>
</div>
</div>

      </div>
    </div>
  </body>
</html>
